# Урок 10. Дисперсионный анализ
# 1) Провести дисперсионный анализ для определения того, есть ли различия 
# среднего роста среди взрослых футболистов, хоккеистов и штангистов.
# Даны значения роста в трех группах случайно выбранных спортсменов:
# Футболисты: 173, 175, 180, 178, 177, 185, 183, 182.
# Хоккеисты: 177, 179, 180, 188, 177, 172, 171, 184, 180.
# Штангисты: 172, 173, 169, 177, 166, 180, 178, 177, 172, 166, 170.

import scipy. stats as stats
import numpy as np

A = np.array([173, 175, 180, 178, 177, 185, 183, 182])
B = np.array([177, 179, 180, 188, 177, 172, 171, 184, 180])
C = np.array([172, 173, 169, 177, 166, 180, 178, 177, 172, 166, 170])

print(np.mean(A))
print(np.mean(B))
print(np.mean(C))


from scipy.stats import shapiro
print(shapiro(A))
print(shapiro(B))
print(shapiro(C))

# Поскольку 
# ShapiroResult(statistic=0.9775082468986511, pvalue=0.9495404362678528)
# ShapiroResult(statistic=0.9579196572303772, pvalue=0.7763139009475708)
# ShapiroResult(statistic=0.9386808276176453, pvalue=0.5051165223121643)

# делаем вывод о нрмальности распределения всех трех выборок

print(stats. bartlett (A, B, C))

# Поскольку BartlettResult(statistic=0.4640521043406442, pvalue=0.7929254656083131),
# принимаем нулевую гипотезу

from scipy.stats import f_oneway

print(f_oneway(A, B, C))

# Поскольку F_onewayResult(statistic=5.500053450812596, pvalue=0.010482206918698693),
# принимаем альтенативную гипотезу - статистически значимые различия среднего роста есть.